[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/choose-ride.component.js:9:23
 export class ChooseRideComponent extends RoboComponent {
   /** @type {Ride[]} */
   rides = [];
-  connectedCallback() {
-    this.appendChild(cloneTemplate(templateChooseRide));
-    rideService.getRides().then((rides) => {
-      this.rides = rides;
-      this.#render();
-    });
-    this.#render();
-  }
+  connectedCallback() {}
 
   #render() {

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/choose-ride.component.js:11:44
   rides = [];
   connectedCallback() {
     this.appendChild(cloneTemplate(templateChooseRide));
-    rideService.getRides().then((rides) => {
-      this.rides = rides;
-      this.#render();
-    });
+    rideService.getRides().then((rides) => {});
     this.#render();
   }

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/choose-ride.component.js:18:13
     this.#render();
   }
 
-  #render() {
-    this.by.id.rides.replaceChildren(
-      ...this.rides.map((ride) => this.#renderOrderRow(ride)),
-    );
-  }
+  #render() {}
 
   /** @param {Ride} ride */

[Timeout] ArrowFunction
pgats-ci-projeto-base/src/components/choose-ride.component.js:20:25
 
   #render() {
     this.by.id.rides.replaceChildren(
-      ...this.rides.map((ride) => this.#renderOrderRow(ride)),
+      ...this.rides.map(() => undefined),
     );
   }

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/choose-ride.component.js:25:25
   }
 
   /** @param {Ride} ride */
-  #renderOrderRow(ride) {
-    const element = cloneTemplate(templateRide);
-    const row = new Selector(element);
-    row.class.cardTitle.innerText = ride.name;
-    row.class.cardText.innerText = ride.description;
-    const img = /** @type {HTMLImageElement} */ (row.class.cardImgTop);
-    img.src = ride.image;
-    const anchor = /** @type {HTMLAnchorElement} */ (row.class.cardLink);
-    anchor.href = `#ride/${ride.id}`;
-    anchor.innerText = `Choose ${ride.name}`;
-    anchor.addEventListener('click', (e) => {
-      e.preventDefault();
-      router.navigate(['ride', ride.id]);
-    });
-    return element;
-  }
+  #renderOrderRow(ride) {}
 }
 customElements.define('robo-choose-ride', ChooseRideComponent);

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/choose-ride.component.js:35:45
     const anchor = /** @type {HTMLAnchorElement} */ (row.class.cardLink);
     anchor.href = `#ride/${ride.id}`;
     anchor.innerText = `Choose ${ride.name}`;
-    anchor.addEventListener('click', (e) => {
-      e.preventDefault();
-      router.navigate(['ride', ride.id]);
-    });
+    anchor.addEventListener('click', (e) => {});
     return element;
   }

[Timeout] StringLiteral
pgats-ci-projeto-base/src/components/choose-ride.component.js:35:29
     const anchor = /** @type {HTMLAnchorElement} */ (row.class.cardLink);
     anchor.href = `#ride/${ride.id}`;
     anchor.innerText = `Choose ${ride.name}`;
-    anchor.addEventListener('click', (e) => {
+    anchor.addEventListener("", (e) => {
       e.preventDefault();
       router.navigate(['ride', ride.id]);
