[Timeout] StringLiteral
pgats-ci-projeto-base/src/components/choose-ride.template.js:13:52
   </div>
 `;
 
-export const templateRide = document.createElement('template');
+export const templateRide = document.createElement("");
 templateRide.innerHTML = `
   <div class="col-12 col-md-6 col-lg-4">
