[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/ride.component.js:17:19
 
   #numPeople = 1;
 
-  get numPeople() {
-    return this.#numPeople;
-  }
+  get numPeople() {}
   set numPeople(value) {
     this.#numPeople = value;

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/ride.component.js:20:24
   get numPeople() {
     return this.#numPeople;
   }
-  set numPeople(value) {
-    this.#numPeople = value;
-    this.#render();
-  }
+  set numPeople(value) {}
 
   /** @param {Event} event */

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/ride.component.js:26:33
   }
 
   /** @param {Event} event */
-  handleRideSelect = (event) => {
-    this.numPeople = parseInt(
-      /** @type {HTMLInputElement} */ (event.target).value,
-    );
-  };
+  handleRideSelect = (event) => {};
 
   /** @return {Person[]} */

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/ride.component.js:33:15
   };
 
   /** @return {Person[]} */
-  getPeople() {
-    /** @type {Person[]} */
-    const people = [];
-
-    const heightInputs = [...this.by.id.heightInputs.querySelectorAll('input')];
-    for (let i = 0; i < this.numPeople; i++) {
-      people.push({
-        index: i + 1,
-        height: heightInputs[i]?.valueAsNumber ?? 0,
-      });
-    }
-    return people;
-  }
+  getPeople() {}
 
   cancel = () => {

[Timeout] EqualityOperator
pgats-ci-projeto-base/src/components/ride.component.js:38:21
     const people = [];
 
     const heightInputs = [...this.by.id.heightInputs.querySelectorAll('input')];
-    for (let i = 0; i < this.numPeople; i++) {
+    for (let i = 0; i <= this.numPeople; i++) {
       people.push({
         index: i + 1,

[Timeout] EqualityOperator
pgats-ci-projeto-base/src/components/ride.component.js:38:21
     const people = [];
 
     const heightInputs = [...this.by.id.heightInputs.querySelectorAll('input')];
-    for (let i = 0; i < this.numPeople; i++) {
+    for (let i = 0; i >= this.numPeople; i++) {
       people.push({
         index: i + 1,

[Timeout] ObjectLiteral
pgats-ci-projeto-base/src/components/ride.component.js:39:19
 
     const heightInputs = [...this.by.id.heightInputs.querySelectorAll('input')];
     for (let i = 0; i < this.numPeople; i++) {
-      people.push({
-        index: i + 1,
-        height: heightInputs[i]?.valueAsNumber ?? 0,
-      });
+      people.push({});
     }
     return people;

[Timeout] ArithmeticOperator
pgats-ci-projeto-base/src/components/ride.component.js:40:16
     const heightInputs = [...this.by.id.heightInputs.querySelectorAll('input')];
     for (let i = 0; i < this.numPeople; i++) {
       people.push({
-        index: i + 1,
+        index: i - 1,
         height: heightInputs[i]?.valueAsNumber ?? 0,
       });

[Timeout] OptionalChaining
pgats-ci-projeto-base/src/components/ride.component.js:41:17
     for (let i = 0; i < this.numPeople; i++) {
       people.push({
         index: i + 1,
-        height: heightInputs[i]?.valueAsNumber ?? 0,
+        height: heightInputs[i].valueAsNumber ?? 0,
       });
     }

[Timeout] LogicalOperator
pgats-ci-projeto-base/src/components/ride.component.js:41:17
     for (let i = 0; i < this.numPeople; i++) {
       people.push({
         index: i + 1,
-        height: heightInputs[i]?.valueAsNumber ?? 0,
+        height: heightInputs[i]?.valueAsNumber && 0,
       });
     }

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/ride.component.js:47:18
     return people;
   }
 
-  cancel = () => {
-    router.navigate([]);
-  };
+  cancel = () => {};
 
   /** @param {Event} event */

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/ride.component.js:52:23
   };
 
   /** @param {Event} event */
-  submit = (event) => {
-    event.preventDefault();
-    const people = this.getPeople();
-    if (this.ride.minHeight) {
-      const invalidHeights = people.filter(
-        ({ height }) => !this.hasValidHeight(height),
-      );
-      if (invalidHeights.length) {
-        this.by.id.alert.style.display = 'block';
-        this.by.id.alertText.innerHTML = `${invalidHeights.map(({ index }) => `Person ${index} is too short for this ride`).join('<br />')}`;
-        return;
-      }
-    }
-    orderService.currentOrder = { ride: this.ride, people };
-    router.navigate(['success']);
-  };
+  submit = (event) => {};
 
   connectedCallback() {

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/components/ride.component.js:55:9
   submit = (event) => {
     event.preventDefault();
     const people = this.getPeople();
-    if (this.ride.minHeight) {
+    if (false) {
       const invalidHeights = people.filter(
         ({ height }) => !this.hasValidHeight(height),

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/components/ride.component.js:55:9
   submit = (event) => {
     event.preventDefault();
     const people = this.getPeople();
-    if (this.ride.minHeight) {
+    if (true) {
       const invalidHeights = people.filter(
         ({ height }) => !this.hasValidHeight(height),

[Timeout] MethodExpression
pgats-ci-projeto-base/src/components/ride.component.js:56:30
     event.preventDefault();
     const people = this.getPeople();
     if (this.ride.minHeight) {
-      const invalidHeights = people.filter(
-        ({ height }) => !this.hasValidHeight(height),
-      );
+      const invalidHeights = people;
       if (invalidHeights.length) {
         this.by.id.alert.style.display = 'block';

[Timeout] ArrowFunction
pgats-ci-projeto-base/src/components/ride.component.js:57:9
     const people = this.getPeople();
     if (this.ride.minHeight) {
       const invalidHeights = people.filter(
-        ({ height }) => !this.hasValidHeight(height),
+        () => undefined,
       );
       if (invalidHeights.length) {

[Timeout] BooleanLiteral
pgats-ci-projeto-base/src/components/ride.component.js:57:25
     const people = this.getPeople();
     if (this.ride.minHeight) {
       const invalidHeights = people.filter(
-        ({ height }) => !this.hasValidHeight(height),
+        ({ height }) => this.hasValidHeight(height),
       );
       if (invalidHeights.length) {

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/ride.component.js:59:34
       const invalidHeights = people.filter(
         ({ height }) => !this.hasValidHeight(height),
       );
-      if (invalidHeights.length) {
-        this.by.id.alert.style.display = 'block';
-        this.by.id.alertText.innerHTML = `${invalidHeights.map(({ index }) => `Person ${index} is too short for this ride`).join('<br />')}`;
-        return;
-      }
+      if (invalidHeights.length) {}
     }
     orderService.currentOrder = { ride: this.ride, people };

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/components/ride.component.js:59:11
       const invalidHeights = people.filter(
         ({ height }) => !this.hasValidHeight(height),
       );
-      if (invalidHeights.length) {
+      if (true) {
         this.by.id.alert.style.display = 'block';
         this.by.id.alertText.innerHTML = `${invalidHeights.map(({ index }) => `Person ${index} is too short for this ride`).join('<br />')}`;

[Timeout] ArrowFunction
pgats-ci-projeto-base/src/components/ride.component.js:61:64
       );
       if (invalidHeights.length) {
         this.by.id.alert.style.display = 'block';
-        this.by.id.alertText.innerHTML = `${invalidHeights.map(({ index }) => `Person ${index} is too short for this ride`).join('<br />')}`;
+        this.by.id.alertText.innerHTML = `${invalidHeights.map(() => undefined).join('<br />')}`;
         return;
       }

[Timeout] StringLiteral
pgats-ci-projeto-base/src/components/ride.component.js:61:79
       );
       if (invalidHeights.length) {
         this.by.id.alert.style.display = 'block';
-        this.by.id.alertText.innerHTML = `${invalidHeights.map(({ index }) => `Person ${index} is too short for this ride`).join('<br />')}`;
+        this.by.id.alertText.innerHTML = `${invalidHeights.map(({ index }) => ``).join('<br />')}`;
         return;
       }

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/ride.component.js:69:23
     router.navigate(['success']);
   };
 
-  connectedCallback() {
-    this.appendChild(cloneTemplate(templateRidePage));
-    const rideId = this.getAttribute('ride-id');
-    rideService.getRide(rideId).then((ride) => {
-      if (!ride) {
-        router.navigate([]);
-      }
-      this.ride = ride;
-      this.#render();
-    });
-    this.by.id.peopleSelect.addEventListener('input', this.handleRideSelect);
-    this.by.id.previousBtn.addEventListener('click', this.cancel);
-    this.by.id.form.addEventListener('submit', this.submit);
-    this.#render();
-  }
+  connectedCallback() {}
 
   /** @param {number} height */

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/ride.component.js:72:48
   connectedCallback() {
     this.appendChild(cloneTemplate(templateRidePage));
     const rideId = this.getAttribute('ride-id');
-    rideService.getRide(rideId).then((ride) => {
-      if (!ride) {
-        router.navigate([]);
-      }
-      this.ride = ride;
-      this.#render();
-    });
+    rideService.getRide(rideId).then((ride) => {});
     this.by.id.peopleSelect.addEventListener('input', this.handleRideSelect);
     this.by.id.previousBtn.addEventListener('click', this.cancel);

[Timeout] BooleanLiteral
pgats-ci-projeto-base/src/components/ride.component.js:73:11
     this.appendChild(cloneTemplate(templateRidePage));
     const rideId = this.getAttribute('ride-id');
     rideService.getRide(rideId).then((ride) => {
-      if (!ride) {
+      if (ride) {
         router.navigate([]);
       }

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/components/ride.component.js:73:11
     this.appendChild(cloneTemplate(templateRidePage));
     const rideId = this.getAttribute('ride-id');
     rideService.getRide(rideId).then((ride) => {
-      if (!ride) {
+      if (true) {
         router.navigate([]);
       }

[Timeout] StringLiteral
pgats-ci-projeto-base/src/components/ride.component.js:80:45
       this.#render();
     });
     this.by.id.peopleSelect.addEventListener('input', this.handleRideSelect);
-    this.by.id.previousBtn.addEventListener('click', this.cancel);
+    this.by.id.previousBtn.addEventListener("", this.cancel);
     this.by.id.form.addEventListener('submit', this.submit);
     this.#render();

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/ride.component.js:86:26
   }
 
   /** @param {number} height */
-  hasValidHeight(height) {
-    return this.ride.minHeight < height;
-  }
+  hasValidHeight(height) {}
 
   #render() {

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/components/ride.component.js:87:12
 
   /** @param {number} height */
   hasValidHeight(height) {
-    return this.ride.minHeight < height;
+    return true;
   }
 

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/components/ride.component.js:87:12
 
   /** @param {number} height */
   hasValidHeight(height) {
-    return this.ride.minHeight < height;
+    return false;
   }
 

[Timeout] StringLiteral
pgats-ci-projeto-base/src/components/ride.component.js:91:38
   }
 
   #render() {
-    this.by.id.alert.style.display = 'none';
+    this.by.id.alert.style.display = "";
     if (this.ride) {
       this.by.id.title.innerText = this.ride.name;

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/components/ride.component.js:92:9
 
   #render() {
     this.by.id.alert.style.display = 'none';
-    if (this.ride) {
+    if (true) {
       this.by.id.title.innerText = this.ride.name;
       const img = /** @type {HTMLImageElement}*/ (this.by.id.rideImage);

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/components/ride.component.js:92:9
 
   #render() {
     this.by.id.alert.style.display = 'none';
-    if (this.ride) {
+    if (false) {
       this.by.id.title.innerText = this.ride.name;
       const img = /** @type {HTMLImageElement}*/ (this.by.id.rideImage);

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/ride.component.js:98:32
       img.src = this.ride.image;
       img.alt = this.ride.name;
 
-      if (this.ride.minHeight) {
-        const p = cloneTemplate(minimalRideHeightTemplate);
-        new Selector(p).class.minHeight.textContent =
-          this.ride.minHeight.toString();
-        this.by.id.heightInputs.replaceChildren(
-          p,
-          ...new Array(this.numPeople).fill('').map((_, index) => {
-            const element = cloneTemplate(heightTemplate);
-            const row = new Selector(element);
-            const label = /** @type {HTMLLabelElement} */ (
-              row.class.colFormLabel
-            );
-            label.innerText = `Height for person ${index + 1}`;
-            label.htmlFor = `heightInput-${index}`;
-            const input = /** @type {HTMLInputElement} */ (
-              row.class.formControl
-            );
-            input.id = `heightInput-${index}`;
-            return element;
-          }),
-        );
-      }
+      if (this.ride.minHeight) {}
     }
   }

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/components/ride.component.js:98:11
       img.src = this.ride.image;
       img.alt = this.ride.name;
 
-      if (this.ride.minHeight) {
+      if (true) {
         const p = cloneTemplate(minimalRideHeightTemplate);
         new Selector(p).class.minHeight.textContent =

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/ride.component.js:104:67
           this.ride.minHeight.toString();
         this.by.id.heightInputs.replaceChildren(
           p,
-          ...new Array(this.numPeople).fill('').map((_, index) => {
-            const element = cloneTemplate(heightTemplate);
-            const row = new Selector(element);
-            const label = /** @type {HTMLLabelElement} */ (
-              row.class.colFormLabel
-            );
-            label.innerText = `Height for person ${index + 1}`;
-            label.htmlFor = `heightInput-${index}`;
-            const input = /** @type {HTMLInputElement} */ (
-              row.class.formControl
-            );
-            input.id = `heightInput-${index}`;
-            return element;
-          }),
+          ...new Array(this.numPeople).fill('').map((_, index) => {}),
         );
       }

[Timeout] ArithmeticOperator
pgats-ci-projeto-base/src/components/ride.component.js:110:52
             const label = /** @type {HTMLLabelElement} */ (
               row.class.colFormLabel
             );
-            label.innerText = `Height for person ${index + 1}`;
+            label.innerText = `Height for person ${index - 1}`;
             label.htmlFor = `heightInput-${index}`;
             const input = /** @type {HTMLInputElement} */ (

[Timeout] StringLiteral
pgats-ci-projeto-base/src/components/ride.component.js:115:24
             const input = /** @type {HTMLInputElement} */ (
               row.class.formControl
             );
-            input.id = `heightInput-${index}`;
+            input.id = ``;
             return element;
           }),
