[Timeout] StringLiteral
pgats-ci-projeto-base/src/components/ride.template.js:1:56
-export const templateRidePage = document.createElement('template');
+export const templateRidePage = document.createElement("");
 templateRidePage.innerHTML = `<div class="row">
     <h2 id="title" class="col-12 display-4">

[Timeout] StringLiteral
pgats-ci-projeto-base/src/components/ride.template.js:47:28
   </div>`;
 
 export const heightTemplate = document.createElement('template');
-heightTemplate.innerHTML = `<div class="form-group row">
-  <label for="heightInput" class="col-md-4 col-form-label">Height</label>
-  <div class="col-md-8">
-    <input
-      type="number"
-      class="form-control form-control-lg"
-      id="heightInput"
-    />
-  </div>
-  </div>`;
+heightTemplate.innerHTML = ``;
 
 export const minimalRideHeightTemplate = document.createElement('template');
