[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/robo-coasters.component.js:22:23
   /** @type {string | undefined} */
   currentlyViewedRoute;
 
-  connectedCallback() {
-    this.appendChild(cloneTemplate(template));
-    this.view = this.by.id.view;
-    this.routerSubscription = router.onNext((route) => {
-      this.route = route;
-      this.render();
-    });
-  }
+  connectedCallback() {}
 
   disconnectedCallback() {

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/robo-coasters.component.js:25:56
   connectedCallback() {
     this.appendChild(cloneTemplate(template));
     this.view = this.by.id.view;
-    this.routerSubscription = router.onNext((route) => {
-      this.route = route;
-      this.render();
-    });
+    this.routerSubscription = router.onNext((route) => {});
   }
 

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/robo-coasters.component.js:31:26
     });
   }
 
-  disconnectedCallback() {
-    this.routerSubscription();
-  }
+  disconnectedCallback() {}
 
   render() {

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/robo-coasters.component.js:35:12
     this.routerSubscription();
   }
 
-  render() {
-    switch (this.route[0]) {
-      case 'ride':
-        this.view.innerHTML = `<robo-ride ride-id="${this.route[1]}"></robo-ride>`;
-        break;
-      case 'success':
-        this.view.innerHTML = `<robo-success></robo-success>`;
-        break;
-      case '':
-        this.view.innerHTML = `<robo-choose-ride></robo-choose-ride>`;
-      default:
-        router.navigate([]);
-        break;
-    }
-  }
+  render() {}
 }
 

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/components/robo-coasters.component.js:37:7
 
   render() {
     switch (this.route[0]) {
-      case 'ride':
-        this.view.innerHTML = `<robo-ride ride-id="${this.route[1]}"></robo-ride>`;
-        break;
+      case 'ride':
       case 'success':
         this.view.innerHTML = `<robo-success></robo-success>`;

[Timeout] StringLiteral
pgats-ci-projeto-base/src/components/robo-coasters.component.js:37:12
 
   render() {
     switch (this.route[0]) {
-      case 'ride':
+      case "":
         this.view.innerHTML = `<robo-ride ride-id="${this.route[1]}"></robo-ride>`;
         break;

[Timeout] StringLiteral
pgats-ci-projeto-base/src/components/robo-coasters.component.js:38:31
   render() {
     switch (this.route[0]) {
       case 'ride':
-        this.view.innerHTML = `<robo-ride ride-id="${this.route[1]}"></robo-ride>`;
+        this.view.innerHTML = ``;
         break;
       case 'success':

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/components/robo-coasters.component.js:40:7
       case 'ride':
         this.view.innerHTML = `<robo-ride ride-id="${this.route[1]}"></robo-ride>`;
         break;
-      case 'success':
-        this.view.innerHTML = `<robo-success></robo-success>`;
-        break;
+      case 'success':
       case '':
         this.view.innerHTML = `<robo-choose-ride></robo-choose-ride>`;

[Timeout] StringLiteral
pgats-ci-projeto-base/src/components/robo-coasters.component.js:41:31
         this.view.innerHTML = `<robo-ride ride-id="${this.route[1]}"></robo-ride>`;
         break;
       case 'success':
-        this.view.innerHTML = `<robo-success></robo-success>`;
+        this.view.innerHTML = ``;
         break;
       case '':

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/components/robo-coasters.component.js:43:7
       case 'success':
         this.view.innerHTML = `<robo-success></robo-success>`;
         break;
-      case '':
-        this.view.innerHTML = `<robo-choose-ride></robo-choose-ride>`;
+      case '':
       default:
         router.navigate([]);

[Timeout] StringLiteral
pgats-ci-projeto-base/src/components/robo-coasters.component.js:43:12
       case 'success':
         this.view.innerHTML = `<robo-success></robo-success>`;
         break;
-      case '':
+      case "Stryker was here!":
         this.view.innerHTML = `<robo-choose-ride></robo-choose-ride>`;
       default:

[Timeout] StringLiteral
pgats-ci-projeto-base/src/components/robo-coasters.component.js:44:31
         this.view.innerHTML = `<robo-success></robo-success>`;
         break;
       case '':
-        this.view.innerHTML = `<robo-choose-ride></robo-choose-ride>`;
+        this.view.innerHTML = ``;
       default:
         router.navigate([]);

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/components/robo-coasters.component.js:45:7
         break;
       case '':
         this.view.innerHTML = `<robo-choose-ride></robo-choose-ride>`;
-      default:
-        router.navigate([]);
-        break;
+      default:
     }
   }

[Timeout] ArrayDeclaration
pgats-ci-projeto-base/src/components/robo-coasters.component.js:46:25
       case '':
         this.view.innerHTML = `<robo-choose-ride></robo-choose-ride>`;
       default:
-        router.navigate([]);
+        router.navigate(["Stryker was here"]);
         break;
     }

[Timeout] StringLiteral
pgats-ci-projeto-base/src/components/robo-coasters.component.js:52:23
   }
 }
 
-customElements.define('robo-coasters', RoboCoastersComponent);
+customElements.define("", RoboCoastersComponent);
 
