[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/robo.component.js:14:24
   id;
 
   /** @param {HTMLElement} element */
-  constructor(element) {
-    this.#element = element;
-    this.class = new Proxy(
-      {},
-      {
-        get: (_, property) =>
-          this.#element?.querySelector(`.${toKebabCase(String(property))}`),
-      },
-    );
-    this.id = new Proxy(
-      {},
-      {
-        get: (_, property) =>
-          this.#element?.querySelector(`#${toKebabCase(String(property))}`),
-      },
-    );
-  }
+  constructor(element) {}
 }
 

[Timeout] ArrowFunction
pgats-ci-projeto-base/src/components/robo.component.js:19:14
     this.class = new Proxy(
       {},
       {
-        get: (_, property) =>
-          this.#element?.querySelector(`.${toKebabCase(String(property))}`),
+        get: () => undefined,
       },
     );

[Timeout] OptionalChaining
pgats-ci-projeto-base/src/components/robo.component.js:20:11
       {},
       {
         get: (_, property) =>
-          this.#element?.querySelector(`.${toKebabCase(String(property))}`),
+          this.#element.querySelector(`.${toKebabCase(String(property))}`),
       },
     );

[Timeout] ArrowFunction
pgats-ci-projeto-base/src/components/robo.component.js:26:14
     this.id = new Proxy(
       {},
       {
-        get: (_, property) =>
-          this.#element?.querySelector(`#${toKebabCase(String(property))}`),
+        get: () => undefined,
       },
     );

[Timeout] OptionalChaining
pgats-ci-projeto-base/src/components/robo.component.js:27:11
       {},
       {
         get: (_, property) =>
-          this.#element?.querySelector(`#${toKebabCase(String(property))}`),
+          this.#element.querySelector(`#${toKebabCase(String(property))}`),
       },
     );

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/robo.component.js:34:27
 }
 
 /** @param {string} str */
-function toKebabCase(str) {
-  return str.replace(/([a-z0-9])([A-Z])/g, '$1-$2').toLowerCase();
-}
+function toKebabCase(str) {}
 
 /**

[Timeout] MethodExpression
pgats-ci-projeto-base/src/components/robo.component.js:35:10
 
 /** @param {string} str */
 function toKebabCase(str) {
-  return str.replace(/([a-z0-9])([A-Z])/g, '$1-$2').toLowerCase();
+  return str.replace(/([a-z0-9])([A-Z])/g, '$1-$2').toUpperCase();
 }
 

[Timeout] Regex
pgats-ci-projeto-base/src/components/robo.component.js:35:22
 
 /** @param {string} str */
 function toKebabCase(str) {
-  return str.replace(/([a-z0-9])([A-Z])/g, '$1-$2').toLowerCase();
+  return str.replace(/([^a-z0-9])([A-Z])/g, '$1-$2').toLowerCase();
 }
 

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/robo.component.js:42:41
  * @param {HTMLTemplateElement} template
  * @returns {HTMLElement}
  */
-export function cloneTemplate(template) {
-  return /** @type {HTMLElement} */ (template.content.cloneNode(true));
-}
+export function cloneTemplate(template) {}
 

[Timeout] BooleanLiteral
pgats-ci-projeto-base/src/components/robo.component.js:43:65
  * @returns {HTMLElement}
  */
 export function cloneTemplate(template) {
-  return /** @type {HTMLElement} */ (template.content.cloneNode(true));
+  return /** @type {HTMLElement} */ (template.content.cloneNode(false));
 }
 
