[Timeout] StringLiteral
pgats-ci-projeto-base/src/components/success.component.js:5:41
 import { orderService } from '../services/order.service.js';
 import { cloneTemplate, RoboComponent } from './robo.component.js';
 
-const template = document.createElement('template');
+const template = document.createElement("");
 template.innerHTML = `<div class="row">
     <p class="robo-rides col-12 display-6"></p>

[Timeout] BlockStatement
pgats-ci-projeto-base/src/components/success.component.js:20:23
   </div>`;
 
 export class SuccessComponent extends RoboComponent {
-  connectedCallback() {
-    this.appendChild(cloneTemplate(template));
-    /** @type {HTMLImageElement} */ (this.by.id.rideImage).src =
-      orderService.currentOrder.ride.image;
-    this.by.class.roboRides.innerText = ridesSummary(orderService.currentOrder);
-  }
+  connectedCallback() {}
 }
 
