[Timeout] BlockStatement
pgats-ci-projeto-base/src/pipes/rides-summary.pipe.js:5:37
  * @param {RideOrder} order
  * @return {string}
  */
-export function ridesSummary(order) {
-  let shortDescription = '';
-  let people = 'people';
-  if (order.ride.minHeight) {
-    shortDescription = ` (>= ${order.people.reduce((acc, person) => (acc.height < person.height ? acc : person)).height} cm)`;
-  }
-  if (order.people.length === 1) {
-    people = 'person';
-  }
-  return `${order.people.length} ${people} ${shortDescription} for the ${order.ride.name}, have fun!`;
-}
+export function ridesSummary(order) {}
 

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/pipes/rides-summary.pipe.js:8:7
 export function ridesSummary(order) {
   let shortDescription = '';
   let people = 'people';
-  if (order.ride.minHeight) {
+  if (true) {
     shortDescription = ` (>= ${order.people.reduce((acc, person) => (acc.height < person.height ? acc : person)).height} cm)`;
   }

[Timeout] BlockStatement
pgats-ci-projeto-base/src/pipes/rides-summary.pipe.js:8:29
 export function ridesSummary(order) {
   let shortDescription = '';
   let people = 'people';
-  if (order.ride.minHeight) {
-    shortDescription = ` (>= ${order.people.reduce((acc, person) => (acc.height < person.height ? acc : person)).height} cm)`;
-  }
+  if (order.ride.minHeight) {}
   if (order.people.length === 1) {
     people = 'person';

[Timeout] EqualityOperator
pgats-ci-projeto-base/src/pipes/rides-summary.pipe.js:9:70
   let shortDescription = '';
   let people = 'people';
   if (order.ride.minHeight) {
-    shortDescription = ` (>= ${order.people.reduce((acc, person) => (acc.height < person.height ? acc : person)).height} cm)`;
+    shortDescription = ` (>= ${order.people.reduce((acc, person) => (acc.height <= person.height ? acc : person)).height} cm)`;
   }
   if (order.people.length === 1) {

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/pipes/rides-summary.pipe.js:9:70
   let shortDescription = '';
   let people = 'people';
   if (order.ride.minHeight) {
-    shortDescription = ` (>= ${order.people.reduce((acc, person) => (acc.height < person.height ? acc : person)).height} cm)`;
+    shortDescription = ` (>= ${order.people.reduce((acc, person) => (true ? acc : person)).height} cm)`;
   }
   if (order.people.length === 1) {

[Timeout] EqualityOperator
pgats-ci-projeto-base/src/pipes/rides-summary.pipe.js:11:7
   if (order.ride.minHeight) {
     shortDescription = ` (>= ${order.people.reduce((acc, person) => (acc.height < person.height ? acc : person)).height} cm)`;
   }
-  if (order.people.length === 1) {
+  if (order.people.length !== 1) {
     people = 'person';
   }

[Timeout] BlockStatement
pgats-ci-projeto-base/src/pipes/rides-summary.pipe.js:11:34
   if (order.ride.minHeight) {
     shortDescription = ` (>= ${order.people.reduce((acc, person) => (acc.height < person.height ? acc : person)).height} cm)`;
   }
-  if (order.people.length === 1) {
-    people = 'person';
-  }
+  if (order.people.length === 1) {}
   return `${order.people.length} ${people} ${shortDescription} for the ${order.ride.name}, have fun!`;
 }
