[Timeout] BlockStatement
GitHub/pgats-ci-projeto-base/src/router.js:7:29
   #routerSubscriptions = new Set();
 
   /** @param {Pick<globalThis, 'addEventListener'> & { location: { hash: string }}} win */
-  constructor(win = window) {
-    this.#global = win;
-    this.#global.addEventListener('hashchange', () => {
-      this.#routerSubscriptions.forEach((sub) => sub(this.#currentRoute));
-    });
-  }
+  constructor(win = window) {}
 
   /** @param {string[]} route */

[Timeout] BlockStatement
GitHub/pgats-ci-projeto-base/src/router.js:9:55
   /** @param {Pick<globalThis, 'addEventListener'> & { location: { hash: string }}} win */
   constructor(win = window) {
     this.#global = win;
-    this.#global.addEventListener('hashchange', () => {
-      this.#routerSubscriptions.forEach((sub) => sub(this.#currentRoute));
-    });
+    this.#global.addEventListener('hashchange', () => {});
   }
 

[Timeout] ArrowFunction
GitHub/pgats-ci-projeto-base/src/router.js:10:41
   constructor(win = window) {
     this.#global = win;
     this.#global.addEventListener('hashchange', () => {
-      this.#routerSubscriptions.forEach((sub) => sub(this.#currentRoute));
+      this.#routerSubscriptions.forEach(() => undefined);
     });
   }

[Timeout] BlockStatement
GitHub/pgats-ci-projeto-base/src/router.js:15:19
   }
 
   /** @param {string[]} route */
-  navigate(route) {
-    this.#currentRoute = route;
-  }
+  navigate(route) {}
   /** @param {RouteCallback} callback */
   onNext(callback) {

[Timeout] BlockStatement
GitHub/pgats-ci-projeto-base/src/router.js:19:20
     this.#currentRoute = route;
   }
   /** @param {RouteCallback} callback */
-  onNext(callback) {
-    this.#routerSubscriptions.add(callback);
-    callback(this.#currentRoute);
-    return () => {
-      this.#routerSubscriptions.delete(callback);
-    };
-  }
+  onNext(callback) {}
 
   get #currentRoute() {

[Timeout] BlockStatement
GitHub/pgats-ci-projeto-base/src/router.js:22:18
   onNext(callback) {
     this.#routerSubscriptions.add(callback);
     callback(this.#currentRoute);
-    return () => {
-      this.#routerSubscriptions.delete(callback);
-    };
+    return () => {};
   }
 

[Timeout] BlockStatement
GitHub/pgats-ci-projeto-base/src/router.js:27:23
     };
   }
 
-  get #currentRoute() {
-    return this.#global.location.hash.substring(1).split('/');
-  }
+  get #currentRoute() {}
   set #currentRoute(route) {
     this.#global.location.hash = `#${route.join('/')}`;

[Timeout] MethodExpression
GitHub/pgats-ci-projeto-base/src/router.js:28:12
   }
 
   get #currentRoute() {
-    return this.#global.location.hash.substring(1).split('/');
+    return this.#global.location.hash.split('/');
   }
   set #currentRoute(route) {

[Timeout] BlockStatement
GitHub/pgats-ci-projeto-base/src/router.js:30:28
   get #currentRoute() {
     return this.#global.location.hash.substring(1).split('/');
   }
-  set #currentRoute(route) {
-    this.#global.location.hash = `#${route.join('/')}`;
-  }
+  set #currentRoute(route) {}
 }
 
