[Timeout] BlockStatement
pgats-ci-projeto-base/src/services/order.service.js:8:29
   /**
    * @param {Storage} localStorage
    */
-  constructor(localStorage) {
-    this.localStorage = localStorage;
-  }
+  constructor(localStorage) {}
 
   /**

[Timeout] BlockStatement
pgats-ci-projeto-base/src/services/order.service.js:15:22
   /**
    * @type {RideOrder}
    */
-  get currentOrder() {
-    if (!this.#currentOrder && this.localStorage.getItem('currentOrder')) {
-      this.#currentOrder = JSON.parse(
-        this.localStorage.getItem('currentOrder'),
-      );
-    }
-    return this.#currentOrder;
-  }
+  get currentOrder() {}
   /**
    * @param {RideOrder} value

[Timeout] BooleanLiteral
pgats-ci-projeto-base/src/services/order.service.js:16:9
    * @type {RideOrder}
    */
   get currentOrder() {
-    if (!this.#currentOrder && this.localStorage.getItem('currentOrder')) {
+    if (this.#currentOrder && this.localStorage.getItem('currentOrder')) {
       this.#currentOrder = JSON.parse(
         this.localStorage.getItem('currentOrder'),

[Timeout] LogicalOperator
pgats-ci-projeto-base/src/services/order.service.js:16:9
    * @type {RideOrder}
    */
   get currentOrder() {
-    if (!this.#currentOrder && this.localStorage.getItem('currentOrder')) {
+    if (!this.#currentOrder || this.localStorage.getItem('currentOrder')) {
       this.#currentOrder = JSON.parse(
         this.localStorage.getItem('currentOrder'),

[Timeout] BlockStatement
pgats-ci-projeto-base/src/services/order.service.js:26:27
   /**
    * @param {RideOrder} value
    */
-  set currentOrder(value) {
-    this.#currentOrder = value;
-    this.localStorage.setItem('currentOrder', JSON.stringify(value));
-  }
+  set currentOrder(value) {}
 
   clear() {

[Timeout] BlockStatement
pgats-ci-projeto-base/src/services/order.service.js:31:11
     this.localStorage.setItem('currentOrder', JSON.stringify(value));
   }
 
-  clear() {
-    this.currentOrder = undefined;
-  }
+  clear() {}
 }
 
