[Timeout] BlockStatement
pgats-ci-projeto-base/src/services/ride.service.js:6:20
    *
    * @returns {Promise<Ride[]>}
    */
-  async getRides() {
-    const response = await fetch('api/rides.json');
-    return response.json();
-  }
+  async getRides() {}
 
   /**

[Timeout] BlockStatement
pgats-ci-projeto-base/src/services/ride.service.js:16:25
    * @param {string} rideId
    * @returns {Promise<Ride | undefined>}
    */
-  async getRide(rideId) {
-    const rides = await this.getRides();
-    return rides.find((ride) => ride.id === rideId);
-  }
+  async getRide(rideId) {}
 }
 

[Timeout] ConditionalExpression
pgats-ci-projeto-base/src/services/ride.service.js:18:33
    */
   async getRide(rideId) {
     const rides = await this.getRides();
-    return rides.find((ride) => ride.id === rideId);
+    return rides.find((ride) => false);
   }
 }

[Timeout] EqualityOperator
pgats-ci-projeto-base/src/services/ride.service.js:18:33
    */
   async getRide(rideId) {
     const rides = await this.getRides();
-    return rides.find((ride) => ride.id === rideId);
+    return rides.find((ride) => ride.id !== rideId);
   }
 }
